from typing import List, Dict, Union



async def get_most_frequent_exercises() -> List[Dict[str, Union[str, int]]]:
    exercises = [
        {1: 'Приседания'},
        {2: 'Отжимания'},
        {3: 'Планка'},
        {4: 'Выпады'},
        {5: 'Кранчи'},
        {6: 'Отжимания на брусьях'},
        {7: 'Подтягивания'},
        {8: 'Пресс'},
        {9: 'Приседания с гантелями'},
        {10: 'Французский жим'},
        {11: 'Жим ногами'},
        {12: 'Разгибание ног'},
        {13: 'Тяга верхнего блока'},
        # {14: 'Становая тяга'},
        # {15: 'Махи ногой'}
    ]
    return exercises